## MULTIPLE LINEAR REGRESSION İLE KONUT FİYAT TAHMİNİ
## (HOUSING PRICE FORECAST WITH MULTIPLE LINEAR REGRESSION)

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

In [2]:
df = pd.read_csv("multilinearregression.csv",sep=";")

In [3]:
df

   alan  odasayisi  binayasi   fiyat
0   180          5        10  510000
1   225          4        18  508000
2   260          3         2  548000
3   320          6        10  650000
4   335          4         9  628000
5   345          5        14  632000
6   355          3         0  680000
7   400          4        10  725000

In [4]:
x = df[['alan', 'odasayisi', 'binayasi']]

In [5]:
x

   alan  odasayisi  binayasi
0   180          5        10
1   225          4        18
2   260          3         2
3   320          6        10
4   335          4         9
5   345          5        14
6   355          3         0
7   400          4        10

In [6]:
y = df['fiyat']

In [7]:
y

0    510000
1    508000
2    548000
3    650000
4    628000
5    632000
6    680000
7    725000
Name: fiyat, dtype: int64

In [8]:
model = linear_model.LinearRegression()
model.fit(x,y)

LinearRegression()

In [9]:
model.intercept_

262365.1503032055

In [10]:
model.coef_

array([ 1018.99865454, 14893.82374984, -2606.68429997])

In [11]:
# 230 metrekare,4 oda,10 yaşında evin fiyat tahmini
# (Price estimate of 230 square meters, 4 rooms, 10 years old house)
model.predict(([[230,4,10]]))

array([530243.29284619])

In [12]:
# Modelimizi kendimiz hesaplayalım.(Let's calculate our model ourselves.)
# y= a + b1X1 + b2X2 + b3X3 
a1 = model.intercept_
b1 = model.coef_[0]
b2 = model.coef_[1]
b3 = model.coef_[2]
x1 = 230
x2 = 4
x3 = 10
y = a1 + b1*x1 + b2*x2 + b3*x3
y

530243.2928461881